In [62]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [63]:
df_test=pd.read_csv('Downloads/test.csv')
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [10]:
df_test.shape

(233599, 11)

In [11]:
df_Train=pd.read_csv('Downloads/Train.csv')
df_Train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [12]:
df_Train.shape

(550068, 12)

##Combine the Both Train and Test Data

In [13]:
df=df_Train.append(df_test)

C:\Users\Pilot\AppData\Local\Temp\ipykernel_9052\2798158086.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df_Train.append(df_test)

In [14]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [15]:
df.shape

(783667, 12)

In [16]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
dtype: object

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     783667 non-null  int64
 1   Product_ID                  783667 non-null  object
 2   Gender                      783667 non-null  object
 3   Age                         783667 non-null  object
 4   Occupation                  783667 non-null  int64
 5   City_Category               783667 non-null  object
 6   Stay_In_Current_City_Years  783667 non-null  object
 7   Marital_Status              783667 non-null  int64
 8   Product_Category_1          783667 non-null  int64
 9   Product_Category_2          537685 non-null  float64
 10  Product_Category_3          237858 non-null  float64
 11  Purchase                    550068 non-null  float64
dtypes: float64(3), int64(4), object(5)
memory usage: 77.7+ MB

In [18]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            245982
Product_Category_3            545809
Purchase                      233599
dtype: int64

In [19]:
df.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,7.836670e+05,783667.000000,783667.000000,783667.000000,537685.000000,237858.000000,550068.000000
mean,1.003029e+06,8.079300,0.409777,5.366196,9.844506,12.668605,9263.968713
std,1.727267e+03,6.522206,0.491793,3.878160,5.089093,4.125510,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001519e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003075e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [20]:
df.describe(include='O')

       Product_ID  Gender     Age City_Category Stay_In_Current_City_Years
count      783667  783667  783667        783667                     783667
unique       3677       2       7             3                          5
top     P00265242       M   26-35             B                          1
freq         2709  590031  313015        329739                     276425

In [21]:
#categorical variable
df_cat=df.select_dtypes(include='O')
df_cat.columns

Index(['Product_ID', 'Gender', 'Age', 'City_Category',
       'Stay_In_Current_City_Years'],
      dtype='object')

In [22]:
## print the frequency of the each  categorical variable
for col in df_cat:
    print('The frequency of categorical variable:',col)
    print(df[col].value_counts())
    print(" ")

The frequency of categorical variable: Product_ID
P00265242    2709
P00025442    2310
P00110742    2292
P00112142    2279
P00046742    2084
             ...
P00185942       1
P00104342       1
P00074742       1
P00081342       1
P00253842       1
Name: Product_ID, Length: 3677, dtype: int64

The frequency of categorical variable: Gender
M    590031
F    193636
Name: Gender, dtype: int64

The frequency of categorical variable: Age
26-35    313015
36-45    156724
18-25    141953
46-50     65278
51-55     54784
55+       30579
0-17      21334
Name: Age, dtype: int64

The frequency of categorical variable: City_Category
B    329739
C    243684
A    210244
Name: City_Category, dtype: int64

The frequency of categorical variable: Stay_In_Current_City_Years
1     276425
2     145427
3     135428
4+    120671
0     105716
Name: Stay_In_Current_City_Years, dtype: int64

In [23]:
df.isnull().sum()[df.isnull().sum()>=1]

Product_Category_2    245982
Product_Category_3    545809
Purchase              233599
dtype: int64

In [24]:
df['Product_Category_3']=df['Product_Category_3'].fillna(0)

In [25]:
df['Product_Category_2']=df['Product_Category_2'].fillna(0)

In [26]:
df.isnull().sum()

User_ID                            0
Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
City_Category                      0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2                 0
Product_Category_3                 0
Purchase                      233599
dtype: int64

In [27]:
pd.get_dummies(df['Gender'],drop_first=1)

        M
0       0
1       0
2       0
3       0
4       1
...    ..
233594  0
233595  0
233596  0
233597  0
233598  0

[783667 rows x 1 columns]

In [28]:
df['Gender']=df['Gender'].map({'F':0,'M':1})
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,0-17,10,A,2,0,3,0.0,0.0,8370.0
1,1000001,P00248942,0,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,0,0-17,10,A,2,0,12,0.0,0.0,1422.0
3,1000001,P00085442,0,0-17,10,A,2,0,12,14.0,0.0,1057.0
4,1000002,P00285442,1,55+,16,C,4+,0,8,0.0,0.0,7969.0

In [29]:
df['Age'].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [30]:
df['Age']=df['Age'].map({'0-17':1,'18-25':2,'26-35':3,'36-45':4,'46-50':5,'51-55':6, '55+':7})
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,1,10,A,2,0,3,0.0,0.0,8370.0
1,1000001,P00248942,0,1,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,0,1,10,A,2,0,12,0.0,0.0,1422.0
3,1000001,P00085442,0,1,10,A,2,0,12,14.0,0.0,1057.0
4,1000002,P00285442,1,7,16,C,4+,0,8,0.0,0.0,7969.0

In [31]:
df['City_Category'].unique()

array(['A', 'C', 'B'], dtype=object)

In [32]:
df['City_Category']=df['City_Category'].map({'A':0,'B':1,'C':2})
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,1,10,0,2,0,3,0.0,0.0,8370.0
1,1000001,P00248942,0,1,10,0,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,0,1,10,0,2,0,12,0.0,0.0,1422.0
3,1000001,P00085442,0,1,10,0,2,0,12,14.0,0.0,1057.0
4,1000002,P00285442,1,7,16,2,4+,0,8,0.0,0.0,7969.0

In [33]:
df.shape

(783667, 12)

In [34]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [35]:
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].str.replace('+','')

C:\Users\Pilot\AppData\Local\Temp\ipykernel_9052\2063355665.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].str.replace('+','')

In [36]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4', '3', '1', '0'], dtype=object)

In [37]:
df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].replace(['2', '4', '3', '1', '0'],[2,4,3,1,0])

In [38]:
df['Stay_In_Current_City_Years'].unique()

array([2, 4, 3, 1, 0], dtype=int64)

In [39]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,0,1,10,0,2,0,3,0.0,0.0,8370.0
1,1000001,P00248942,0,1,10,0,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,0,1,10,0,2,0,12,0.0,0.0,1422.0
3,1000001,P00085442,0,1,10,0,2,0,12,14.0,0.0,1057.0
4,1000002,P00285442,1,7,16,2,4,0,8,0.0,0.0,7969.0

In [40]:
df['Occupation'].value_counts()

4     103086
0      98850
7      84127
1      67687
17     57418
20     47840
12     44448
14     38782
2      37996
16     36122
6      29102
3      25126
10     18304
5      17373
15     17356
11     16593
19     11919
13     11053
18      9367
9       8929
8       2189
Name: Occupation, dtype: int64

In [41]:
## Do binning for occupation
df['Occupation']=pd.cut(df.Occupation,bins=[-1,5,10,15,20],labels=[0,1,2,3])

In [42]:
df['Occupation'].value_counts()

0    350118
3    162666
1    142651
2    128232
Name: Occupation, dtype: int64

In [43]:
df['Occupation'].dtypes

CategoricalDtype(categories=[0, 1, 2, 3], ordered=True)

In [44]:
##covert the data type into float64
df['Occupation']=df['Occupation'].astype('float64')

In [45]:
df['Occupation'].dtypes

dtype('float64')

In [46]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                          int64
Age                             int64
Occupation                    float64
City_Category                   int64
Stay_In_Current_City_Years      int64
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
dtype: object

In [47]:
df=df.drop(['User_ID','Product_ID'],axis=1)

In [48]:
df.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,0,1,1.0,0,2,0,3,0.0,0.0,8370.0
1,0,1,1.0,0,2,0,1,6.0,14.0,15200.0
2,0,1,1.0,0,2,0,12,0.0,0.0,1422.0
3,0,1,1.0,0,2,0,12,14.0,0.0,1057.0
4,1,7,3.0,2,4,0,8,0.0,0.0,7969.0

In [49]:
df_test.shape

(233599, 11)

In [50]:
df_Train.shape

(550068, 12)

In [51]:
df1=df.copy(deep=True)

In [52]:
df_test=df1[df1['Purchase'].isnull()]
df_test.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1,5,1.0,1,2,1,1,11.0,0.0,NaN
1,1,3,3.0,2,0,0,3,5.0,0.0,NaN
2,0,4,0.0,1,4,1,5,14.0,0.0,NaN
3,0,4,0.0,1,4,1,4,9.0,0.0,NaN
4,0,3,0.0,2,1,0,4,5.0,12.0,NaN

In [53]:
df_test.shape

(233599, 10)

In [54]:
df_train=df1[~df1['Purchase'].isnull()]
df_train.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,0,1,1.0,0,2,0,3,0.0,0.0,8370.0
1,0,1,1.0,0,2,0,1,6.0,14.0,15200.0
2,0,1,1.0,0,2,0,12,0.0,0.0,1422.0
3,0,1,1.0,0,2,0,12,14.0,0.0,1057.0
4,1,7,3.0,2,4,0,8,0.0,0.0,7969.0

In [55]:
df_Train.shape

(550068, 12)

In [56]:
y=df_train['Purchase']
y.head()

0     8370.0
1    15200.0
2     1422.0
3     1057.0
4     7969.0
Name: Purchase, dtype: float64

In [64]:
X=df_train.drop('Purchase', axis=1)
X.head()

,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,0,1,1.0,0,2,0,3,0.0,0.0
1,0,1,1.0,0,2,0,1,6.0,14.0
2,0,1,1.0,0,2,0,12,0.0,0.0
3,0,1,1.0,0,2,0,12,14.0,0.0
4,1,7,3.0,2,4,0,8,0.0,0.0

In [65]:
print('X_shape:',X.shape)
print('y_shape:',y.shape)

X_shape: (550068, 9)
y_shape: (550068,)

Linear Regression

In [66]:
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
lr= LinearRegression()
from sklearn.metrics import mean_squared_error,r2_score
from math import sqrt

In [67]:
X_train,X_test, y_train, y_test = train_test_split(X, y, test_size=0.3,random_state =100)

In [68]:
lr.fit(X_train,y_train)

LinearRegression()

In [69]:
tr_pred=lr.predict(X_train)
ts_pred=lr.predict(X_test)

In [70]:
Mean_Squared_Error_Train = mean_squared_error(y_train,tr_pred)
Root_Mean_Squared_Error_Train = np.sqrt(Mean_Squared_Error_Train)
Mean_Squared_Error_Test = mean_squared_error(y_test, ts_pred)
Root_Mean_Squared_Error_Test = np.sqrt(Mean_Squared_Error_Test)
R_Squared_Test=r2_score(y_test,ts_pred)
R_Squared_Train=r2_score(y_train,tr_pred)


print('Mean_Squared_Error_Train:',Mean_Squared_Error_Train)
print('Mean_Squared_Error_Test:',Mean_Squared_Error_Test)
print('Root_Mean_Squared_Error_Train:',Root_Mean_Squared_Error_Train)
print('Root_Mean_Squared_Error_Test:',Root_Mean_Squared_Error_Test)
print('R_Squared_Train :',R_Squared_Train*100)
print('R_Squared_Test:',R_Squared_Test*100)

Mean_Squared_Error_Train: 21351064.853551902
Mean_Squared_Error_Test: 21484225.433950115
Root_Mean_Squared_Error_Train: 4620.72124819837
Root_Mean_Squared_Error_Test: 4635.107920421067
R_Squared_Train : 15.290348795328423
R_Squared_Test: 15.05400421386347

In [71]:
cols = ['Model', 'R-squared', 'RMSE']
result_tabulation = pd.DataFrame(columns = cols)
LinearRegression = pd.Series({'Model': "Linear Regression",
                 'R-squared' : R_Squared_Train*100,  'RMSE' :Root_Mean_Squared_Error_Train})
result_tabulation = result_tabulation.append(LinearRegression , ignore_index = True)
result_tabulation

C:\Users\Pilot\AppData\Local\Temp\ipykernel_9052\1432239423.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  result_tabulation = result_tabulation.append(LinearRegression , ignore_index = True)

               Model  R-squared         RMSE
0  Linear Regression  15.290349  4620.721248